blogs/nginx-config-trap.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-11 Tue 12:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>nginx 配置陷阱</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="root" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">nginx 配置陷阱</h1>

<div id="outline-container-org1b676fe" class="outline-2">
<h2 id="org1b676fe"><span class="section-number-2">1</span> 配置允许跨行，以分号判断结尾</h2>
<div class="outline-text-2" id="text-1">
<p>
这通常不是问题，对于 <code>log_format</code> 指令来说，这是非常有用的特性，它的参数太长，往往需要分行。对于大部分指令，如果忘记加分号，会报错，因为它们的参数有个数约束。例如：
</p>
<pre class="example">
proxy_http_version 1.0
proxy_read_timeout 300s;
</pre>
<p>
这时会报错，因为 <code>proxy_http_version</code> 需要1个参数，而此时提供了3个，因为这个配置等价于 <code>proxy_http_version 1.0 proxy_read_timeout 300s;</code> 。某些指令就没那么幸运了，
</p>
<pre class="example">
server_name example.com
proxy_read_timeout 300s;
</pre>
<p>
这时不会报错，并且令人惊讶的是 host 为 <code>300s</code> 竟然也可以访问。令人沮丧的是， <code>proxy_read_timeout 300s;</code> 这个配置被吞掉了，没有生效。对于这种不生效表现也不明显的配置，排查起来可困难了。
</p>
</div>
</div>

<div id="outline-container-orge5270c7" class="outline-2">
<h2 id="orge5270c7"><span class="section-number-2">2</span> 第一个server作为作为 <code>default_server</code></h2>
<div class="outline-text-2" id="text-2">
<p>
nginx的 <code>server</code> 指令指定访问该 <b>server</b> 段需要的host，除非 <b>server</b> 是 <code>default_server</code> ，否则如果host不匹配，跳过该 <b>server</b> 段。
一个 <b>server</b> 要想成为 <code>default_server</code> ，必须是配置里的一个 <b>server</b> 段，或者在 <code>listen</code> 的参数中指定 <code>default_server</code> 。
</p>

<p>
<code>default_server</code> 的这个规则，是利于访问者的，对于想通过host限制访问者的人来说是不利的。
</p>

<p>
我们站点配置的一个 <b>server</b> 段使用内网域名，提供更多的接口，并且很多免认证。另一个 <b>server</b> 段使用公网域名，提供较少的接口，并且全部需要认证。此时我们就不希望任何 <b>server</b> 段成为 <code>default_server</code> ，至少不希望内网域名成为。避免业务变更，导致未配置的域名访问 <code>default_server</code> 。（我们的站点，依赖更外围的负载均衡，分别转发内外网的流量，不用担心外网流量冒充内网域名访问）。
</p>

<p>
为了避免 <code>default_server</code> 利于访问者的规则，最好总是配置一个拒绝访问的 <code>default_server</code> ，这样任何访问总是完全匹配 <b>server</b> 段的host。
</p>

<pre class="example">
server
{
  listen *:80 default_server;
  location / {
    return 403;
  }
}
</pre>
</div>
</div>

<div id="outline-container-org3289d89" class="outline-2">
<h2 id="org3289d89"><span class="section-number-2">3</span> 启动时只检查语法合法性,不检查配置有效性</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org1d6a81e" class="outline-3">
<h3 id="org1d6a81e"><span class="section-number-3">3.1</span> 路径有关的配置</h3>
<div class="outline-text-3" id="text-3-1">
<p>
例如: <code>proxy_cache_path</code> <code>proxy_temp_path</code> 如果路径不存在，或者没有权限启动也没有问题，但是运行时如果碰到需要写入这些路径，则会报错。这个报错可能只是nginx的一条日志，并不体现在http code上。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2020-02-11 Tue 12:34</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
